stm32-rs/stm32g4xx-hal/src/serial/usart.rs
use core::fmt::{self, Debug};
use core::marker::PhantomData;

use crate::dma::{
    mux::DmaMuxResources, traits::TargetAddress, MemoryToPeripheral, PeripheralToMemory,
};
use crate::gpio::{self, OpenDrain};
use crate::rcc::{Enable, GetBusFreq, Rcc, RccBus, Reset};
use crate::stm32::*;

use cortex_m::interrupt;
use nb::block;

use embedded_hal_old::serial::Write;
use embedded_io::{ReadReady, WriteReady};

use crate::serial::config::*;
/// Serial error
#[derive(Debug)]
#[cfg_attr(feature = "defmt", derive(defmt::Format))]
pub enum Error {
    /// Framing error
    Framing,
    /// Noise error
    Noise,
    /// RX buffer overrun
    Overrun,
    /// Parity check error
    Parity,
}

impl embedded_io::Error for Error {
    fn kind(&self) -> embedded_io::ErrorKind {
        match self {
            Error::Framing => embedded_io::ErrorKind::InvalidData,
            Error::Noise => embedded_io::ErrorKind::InvalidData,
            Error::Overrun => embedded_io::ErrorKind::Other,
            Error::Parity => embedded_io::ErrorKind::InvalidData,
        }
    }
}

/// Interrupt event
pub enum Event {
    /// TXFIFO reaches the threshold
    TXFT = 1 << 27,
    /// This bit is set by hardware when the threshold programmed in RXFTCFG in USART_CR3 register is reached.
    RXFT = 1 << 26,

    /// RXFIFO full
    RXFF = 1 << 24,
    /// TXFIFO empty
    TXFE = 1 << 23,

    /// Active when a communication is ongoing on the RX line
    BUSY = 1 << 16,

    /// Receiver timeout.This bit is set by hardware when the timeout value,
    /// programmed in the RTOR register has lapsed, without any communication.
    RTOF = 1 << 11,
    /// Transmit data register empty. New data can be sent
    Txe = 1 << 7,

    /// Transmission Complete. The last data written in the USART_TDR has been transmitted out of the shift register.
    TC = 1 << 6,
    /// New data has been received
    Rxne = 1 << 5,
    /// Idle line state detected
    Idle = 1 << 4,

    /// Overrun error
    ORE = 1 << 3,

    /// Noise detection flag
    NE = 1 << 2,

    /// Framing error
    FE = 1 << 1,

    /// Parity error
    PE = 1 << 0,
}
impl Event {
    fn val(self) -> u32 {
        self as u32
    }
}

/// Serial receiver
pub struct Rx<USART, Pin, Dma> {
    pin: Pin,
    _usart: PhantomData<USART>,
    _dma: PhantomData<Dma>,
}

/// Serial transmitter
pub struct Tx<USART, Pin, Dma> {
    pin: Pin,
    usart: USART,
    _dma: PhantomData<Dma>,
}

/// Serial abstraction
pub struct Serial<USART, TXPin, RXPin> {
    tx: Tx<USART, TXPin, NoDMA>,
    rx: Rx<USART, RXPin, NoDMA>,
}

/// Serial TX pin
pub trait TxPin<USART> {}

/// Serial RX pin
pub trait RxPin<USART> {}

pub struct NoTx;

impl<USART> TxPin<USART> for NoTx {}

/// Type state for Tx/Rx, indicating operation without DMA
#[derive(Debug)]
pub struct NoDMA;
/// Type state for Tx/Rx, indicating configuration for DMA
#[derive(Debug)]
pub struct DMA;

pub trait SerialExt<USART, Config> {
    fn usart<TX, RX>(
        self,
        tx: TX,
        rx: RX,
        config: Config,
        rcc: &mut Rcc,
    ) -> Result<Serial<USART, TX, RX>, InvalidConfig>
    where
        TX: TxPin<USART>,
        RX: RxPin<USART>;
}

impl<USART, TX, RX> fmt::Write for Serial<USART, TX, RX>
where
    Self: embedded_hal_old::serial::Write<u8>,
    <Self as embedded_hal_old::serial::Write<u8>>::Error: Debug,
{
    fn write_str(&mut self, s: &str) -> fmt::Result {
        for c in s.as_bytes() {
            block!(self.write(*c)).unwrap(); // self.write does not fail
        }
        Ok(())
    }
}

impl<USART, Pin, Dma> fmt::Write for Tx<USART, Pin, Dma>
where
    Self: embedded_hal_old::serial::Write<u8>,
    <Self as embedded_hal_old::serial::Write<u8>>::Error: Debug,
{
    fn write_str(&mut self, s: &str) -> fmt::Result {
        for c in s.as_bytes() {
            block!(self.write(*c)).unwrap(); // self.write does not fail
        }
        Ok(())
    }
}

macro_rules! uart_shared {
    ($USARTX:ident, $dmamux_rx:ident, $dmamux_tx:ident,
        tx: [ $($( #[ $pmeta1:meta ] )* ($PTX:ident, $TAF:ident),)+ ],
        rx: [ $($( #[ $pmeta2:meta ] )* ($PRX:ident, $RAF:ident),)+ ]) => {

        $(
            $( #[ $pmeta1 ] )*
            impl TxPin<$USARTX> for gpio::$PTX<gpio::$TAF> {
            }
            $( #[ $pmeta1 ] )*
            impl TxPin<$USARTX> for gpio::$PTX<gpio::$TAF<OpenDrain>> {
            }
        )+

        $(
            $( #[ $pmeta2 ] )*
            impl RxPin<$USARTX> for gpio::$PRX<gpio::$RAF> {
            }
        )+

        impl<Pin, Dma> Rx<$USARTX, Pin, Dma> {
            /// Starts listening for an interrupt event
            pub fn listen(&mut self) {
                let usart = unsafe { &(*$USARTX::ptr()) };
                usart.cr1().modify(|_, w| w.rxneie().set_bit());
            }

            /// Stop listening for an interrupt event
            pub fn unlisten(&mut self) {
                let usart = unsafe { &(*$USARTX::ptr()) };
                usart.cr1().modify(|_, w| w.rxneie().clear_bit());
            }

            /// Return true if the rx register is not empty (and can be read)
            pub fn is_rxne(&self) -> bool {
                let usart = unsafe { &(*$USARTX::ptr()) };
                usart.isr().read().rxne().bit_is_set()
            }

            /// Returns true if the rx fifo threshold has been reached.
            pub fn fifo_threshold_reached(&self) -> bool {
                let usart = unsafe { &(*$USARTX::ptr()) };
                usart.isr().read().rxft().bit_is_set()
            }
        }

        impl<Pin> Rx<$USARTX, Pin, NoDMA> {
            pub fn enable_dma(self) -> Rx<$USARTX, Pin, DMA> {
                // NOTE(unsafe) critical section prevents races
                cortex_m::interrupt::free(|_| unsafe {
                    let cr3 = &(*$USARTX::ptr()).cr3();
                    cr3.modify(|_, w| w.dmar().set_bit());
                });

                Rx {
                    pin: self.pin,
                    _usart: PhantomData,
                    _dma: PhantomData,
                }
            }
            fn data_ready(&mut self) -> nb::Result<(), Error> {
                let usart = unsafe { &(*$USARTX::ptr()) };
                let isr = usart.isr().read();
                Err(
                    if isr.pe().bit_is_set() {
                        usart.icr().write(|w| w.pecf().clear());
                        nb::Error::Other(Error::Parity)
                    } else if isr.fe().bit_is_set() {
                        usart.icr().write(|w| w.fecf().clear());
                        nb::Error::Other(Error::Framing)
                    } else if isr.nf().bit_is_set() {
                        usart.icr().write(|w| w.ncf().clear());
                        nb::Error::Other(Error::Noise)
                    } else if isr.ore().bit_is_set() {
                        usart.icr().write(|w| w.orecf().clear());
                        nb::Error::Other(Error::Overrun)
                    } else if isr.rxne().bit_is_set() {
                        return Ok(())
                    } else {
                        nb::Error::WouldBlock
                    }
                )
            }
        }

