stm32-rs/stm32g4xx-hal/src/serial/usart.rs
        impl<Pin> Rx<$USARTX, Pin, DMA> {
            pub fn disable_dma(self) -> Rx<$USARTX, Pin, NoDMA> {
                // NOTE(unsafe) critical section prevents races
                interrupt::free(|_| unsafe {
                    let cr3 = &(*$USARTX::ptr()).cr3();
                    cr3.modify(|_, w| w.dmar().clear_bit());
                });

                Rx {
                    pin: self.pin,
                    _usart: PhantomData,
                    _dma: PhantomData,
                }
            }
        }

        impl<Pin> embedded_hal_old::serial::Read<u8> for Rx<$USARTX, Pin, NoDMA> {
            type Error = Error;

            fn read(&mut self) -> nb::Result<u8, Error> {
                let usart = unsafe { &(*$USARTX::ptr()) };
                self.data_ready().map(|_| usart.rdr().read().bits() as u8)
            }
        }

        impl<TX, RX> embedded_hal_old::serial::Read<u8> for Serial<$USARTX, TX, RX> {
            type Error = Error;

            fn read(&mut self) -> nb::Result<u8, Error> {
                self.rx.read()
            }
        }

        impl<Pin, Dma> Tx<$USARTX, Pin, Dma> {
            /// Starts listening for an interrupt event
            pub fn listen(&mut self) {
                let usart = unsafe { &(*$USARTX::ptr()) };
                usart.cr1().modify(|_, w| w.txeie().set_bit());
            }

            /// Stop listening for an interrupt event
            pub fn unlisten(&mut self) {
                let usart = unsafe { &(*$USARTX::ptr()) };
                usart.cr1().modify(|_, w| w.txeie().clear_bit());
            }

            /// Return true if the tx register is empty (and can accept data)
            pub fn is_txe(&self) -> bool {
                let usart = unsafe { &(*$USARTX::ptr()) };
                usart.isr().read().txe().bit_is_set()
            }

            /// Returns true if the tx fifo threshold has been reached.
            pub fn fifo_threshold_reached(&self) -> bool {
                let usart = unsafe { &(*$USARTX::ptr()) };
                usart.isr().read().txft().bit_is_set()
            }
        }

        impl<Pin> Tx<$USARTX, Pin, NoDMA> {
            pub fn enable_dma(self) -> Tx<$USARTX, Pin, DMA> {
                // NOTE(unsafe) critical section prevents races
                interrupt::free(|_| unsafe {
                    let cr3 = &(*$USARTX::ptr()).cr3();
                    cr3.modify(|_, w| w.dmat().set_bit());
                });

                Tx {
                    pin: self.pin,
                    usart: self.usart,
                    _dma: PhantomData,
                }
            }
        }

        impl<Pin> Tx<$USARTX, Pin, DMA> {
            pub fn disable_dma(self) -> Tx<$USARTX, Pin, NoDMA> {
                // NOTE(unsafe) critical section prevents races
                interrupt::free(|_| unsafe {
                    let cr3 = &(*$USARTX::ptr()).cr3();
                    cr3.modify(|_, w| w.dmat().clear_bit());
                });

                Tx {
                    pin: self.pin,
                    usart: self.usart,
                    _dma: PhantomData,
                }
            }
        }

        impl<Pin> embedded_hal_old::serial::Write<u8> for Tx<$USARTX, Pin, NoDMA> {
            type Error = Error;

            fn flush(&mut self) -> nb::Result<(), Self::Error> {
                let usart = unsafe { &(*$USARTX::ptr()) };
                if usart.isr().read().tc().bit_is_set() {
                    Ok(())
                } else {
                    Err(nb::Error::WouldBlock)
                }
            }

            fn write(&mut self, byte: u8) -> nb::Result<(), Self::Error> {
                let usart = unsafe { &(*$USARTX::ptr()) };
                if usart.isr().read().txe().bit_is_set() {
                    usart.tdr().write(|w| unsafe { w.bits(byte as u32) });
                    Ok(())
                } else {
                    Err(nb::Error::WouldBlock)
                }
            }
        }

        impl<TX, RX> embedded_hal_old::serial::Write<u8> for Serial<$USARTX, TX, RX> {
            type Error = Error;

            fn flush(&mut self) -> nb::Result<(), Self::Error> {
                self.tx.flush()
            }

            fn write(&mut self, byte: u8) -> nb::Result<(), Self::Error> {
                self.tx.write(byte)
            }
        }

        impl<Pin> embedded_io::ErrorType for Tx<$USARTX, Pin, NoDMA> {
            type Error = Error;
        }
        impl<Pin> WriteReady for Tx<$USARTX, Pin, NoDMA> {
            fn write_ready(&mut self) -> Result<bool, Self::Error> {
                let usart = unsafe { &(*$USARTX::ptr()) };
                Ok(usart.isr().read().txe().bit_is_set())
            }
        }
        // writes until fifo (or tdr) is full
        impl<Pin> embedded_io::Write for Tx<$USARTX, Pin, NoDMA> {
            fn write(&mut self, buf: &[u8]) -> Result<usize, Self::Error> {
                if buf.len() == 0 { return Ok(0) }
                let usart = unsafe { &(*$USARTX::ptr()) };
                while !self.write_ready()? {
                    core::hint::spin_loop()
                }
                // can't know fifo capacity in advance
                let count = buf.into_iter()
                    .take_while(|_| usart.isr().read().txe().bit_is_set())
                    .map(|b| usart.tdr().write(|w| unsafe { w.tdr().bits(*b as u16) }))
                    .count();

                Ok(count)
            }
            fn flush(&mut self) -> Result<(), Error> {
                nb::block!(embedded_hal_old::serial::Write::<u8>::flush(self))
            }
        }

        impl<Pin> embedded_io::ErrorType for Rx<$USARTX, Pin, NoDMA> {
            type Error = Error;
        }
        impl<Pin> ReadReady for Rx<$USARTX, Pin, NoDMA> {
            fn read_ready(&mut self) -> Result<bool, Self::Error> {
                match self.data_ready() {
                    Ok(()) => Ok(true),
                    Err(nb::Error::WouldBlock) => Ok(false),
                    Err(nb::Error::Other(e)) => Err(e),
                }
            }
        }
        impl<Pin> embedded_io::Read for Rx<$USARTX, Pin, NoDMA> {
            fn read(&mut self, buf: &mut [u8]) -> Result<usize, Self::Error> {
                if buf.len() == 0 { return Ok(0) }
                let usart = unsafe { &(*$USARTX::ptr()) };
                let mut count = 0;

                while !self.read_ready()? {
                    core::hint::spin_loop()
                }
                while self.read_ready()? && count < buf.len() {
                    buf[count] = usart.rdr().read().bits() as u8;
                    count += 1
                }
                Ok(count)
            }
        }

        impl<TX, RX> embedded_io::ErrorType for Serial<$USARTX, TX, RX> {
            type Error = Error;
        }
        impl<TX, RX> WriteReady for Serial<$USARTX, TX, RX> {
            fn write_ready(&mut self) -> Result<bool, Self::Error> {
                self.tx.write_ready()
            }
        }
        impl<TX, RX> embedded_io::Write for Serial<$USARTX, TX, RX> {
            fn write(&mut self, buf: &[u8]) -> Result<usize, Self::Error> {
                embedded_io::Write::write(&mut self.tx, buf)
            }
            fn flush(&mut self) -> Result<(), Error> {
                embedded_io::Write::flush(&mut self.tx)
            }
        }
        impl<TX, RX> ReadReady for Serial<$USARTX, TX, RX> {
            fn read_ready(&mut self) -> Result<bool, Self::Error> {
                self.rx.read_ready()
            }
        }
        impl<TX, RX> embedded_io::Read for Serial<$USARTX, TX, RX> {
            fn read(&mut self, buf: &mut [u8]) -> Result<usize, Self::Error> {
                embedded_io::Read::read(&mut self.rx, buf)
            }
        }

        impl<TX, RX> Serial<$USARTX, TX, RX> {

            /// Separates the serial struct into separate channel objects for sending (Tx) and
            /// receiving (Rx)
            pub fn split(self) -> (Tx<$USARTX, TX, NoDMA>, Rx<$USARTX, RX, NoDMA>) {
                (self.tx, self.rx)
            }

            /// Joins the objects created by `split()` back into one Serial object.
            ///
            /// This function can be used in combination with `release()` to deinitialize the
            /// peripheral after it has been split.
            pub fn join(
                tx: Tx<$USARTX, TX, NoDMA>,
                rx: Rx<$USARTX, RX, NoDMA>,
            ) -> Self {
                Serial{
                    tx,
                    rx,
                }
            }

